# yolo_model.yaml  olucak
# YOLO11 UAV/Drone detection modeli (P2-P5) ölçekli
# =================================================

# Global burası
nc: 1  # SADECE drone (tek sınıf) train yaml de buna göre

scales:  # [depth, width, max_channels] model ölçeklendirme katsayıları 
  n: [0.33, 0.25, 1024] # nano
  s: [0.33, 0.50, 1024] # small
  m: [0.67, 0.75, 768]  # medium
  l: [1.00, 1.00, 512]  # large
  x: [1.00, 1.25, 512]  # xlarge

# -------------------------------------------------
# BACKBONE
# Format: [from, repeats, module, args]
# from   : hangi layer'dan input alıyor (-1 = bir önceki)
# repeats: blok sayısı (depth scaling ile çarpılıyor)
# module : Conv, C2f, SPPF, vs.
# args   : modüle giden argümanlar
# -------------------------------------------------
backbone:
  # 0: P1/2
  - [-1, 1, Conv, [64, 3, 2]]        # -> 64 x (H/2) x (W/2) 3x640x640 -> 64x320x320
  # 1: P2/4
  - [-1, 1, Conv, [128, 3, 2]]       # -> 128 x (H/4) x (W/4) 64x320x320 -> 128x160x160
  - [-1, 3, C2f, [128, True]]        # layer 2  (P2 features) feature processing P2

  # 3: P3/8
  - [-1, 1, Conv, [256, 3, 2]]       # -> 256 x (H/8) x (W/8) 128x160x160 -> 256x80x80
  - [-1, 6, C2f, [256, True]]        # layer 4  (P3 features)

  # 5: P4/16
  - [-1, 1, Conv, [512, 3, 2]]       # -> 512 x (H/16) x (W/16) 256x80x80 -> 512x40x40
  - [-1, 6, C2f, [512, True]]        # layer 6  (P4 features)

  # 7: P5/32
  - [-1, 1, Conv, [1024, 3, 2]]      # -> 1024 x (H/32) x (W/32)  512x40x40 -> 1024x20x20
  - [-1, 3, C2f, [1024, True]]       # layer 8  (P5 features)
  - [-1, 1, SPPF, [1024, 5]]         # layer 9  (P5 context)

# -------------------------------------------------
# HEAD (FPN + PAN)
# P2 (xsmall), P3 (small), P4 (medium), P5 (large) scale çıkışları
# -------------------------------------------------
head:
  # ===== FPN (up path) =====
  # P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # layer 10: P5  (H/32 -> H/16) P5 upsample (20->40)
  - [[-1, 6], 1, Concat, [1]]                    # layer 11: concat(P5up, P4)
  - [-1, 3, C2f, [512]]                          # layer 12: fused P4 fused P4/16

  # P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # layer 13: (H/16 -> H/8) 40->80
  - [[-1, 4], 1, Concat, [1]]                    # layer 14: concat(P4up, P3)
  - [-1, 3, C2f, [256]]                          # layer 15: fused P3 P3/8 small

  # P3 -> P2 (small objects)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # layer 16: (H/8 -> H/4) 80->160
  - [[-1, 2], 1, Concat, [1]]                    # layer 17: concat(P3up, P2)
  - [-1, 3, C2f, [128]]                          # layer 18: fused P2  xsmall

  # ===== PAN (down path) =====
  # P2 -> P3
  - [-1, 1, Conv, [128, 3, 2]]                   # layer 19: (H/4 -> H/8) 160->80
  - [[-1, 15], 1, Concat, [1]]                   # layer 20: concat(P2down, fusedP3)
  - [-1, 3, C2f, [256]]                          # layer 21: refined P3 P3/8

  # P3 -> P4
  - [-1, 1, Conv, [256, 3, 2]]                   # layer 22: (H/8 -> H/16)  80->40
  - [[-1, 12], 1, Concat, [1]]                   # layer 23: concat(P3down, fusedP4)
  - [-1, 3, C2f, [512]]                          # layer 24: refined P4    P4/16

  # P4 -> P5
  - [-1, 1, Conv, [512, 3, 2]]                   # layer 25: (H/16 -> H/32)  40->20
  - [[-1, 9], 1, Concat, [1]]                    # layer 26: concat(P4down, P5context)
  - [-1, 3, C2f, [1024]]                         # layer 27: refined P5   P5/32

  # Detect: P2, P3, P4, P5 çok ölçekli çıkış  küçükten büyüğe bu sayılar layerlar
  - [[18, 21, 24, 27], 1, Detect, [nc]]          # layer 28